Repository: ShimizuTheLotus/TagFind
Catalog: TagFind/TagFind/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# AddAppBarButton.Label
source: Add
zh_hans: 添加

# TitleTextBlock.Text
source: Title
zh_hans: 标题

# BackButton.Label
source: Back
zh_hans: 返回

# CreateDatabaseDialog.PrimaryButtonText
source: Create
zh_hans: 新建

# CreateDatabaseDialog.SecondaryButtonText
source: Cancel
zh_hans: 取消

# CreateDatabaseTextBlock.Text
source: Create Database
zh_hans: 创建数据库

# CreateDatabasePathAtTextBlock.Text
source: Create Database Path At...
zh_hans: 在此路径创建数据库...

# SelectFolderButton.Content
source: Select Folder
zh_hans: 选择文件夹

# AddDescriptionTextBlock.Text
source: Add Description
zh_hans: 添加描述

# SetDatabaseNameTextBlock.Text
source: Set Database Name
zh_hans: 设置数据库名称

# SettingsAppBarButton.Label
source: Settings
zh_hans: 设置

# RemoveDatabaseReferenceButton.Label
source: Remove Reference
zh_hans: 移除引用

# ThirdPartyAttributionButton.Label
source: Third-Party Attribution
zh_hans: 第三方致谢

# DescriptionTextBlock.Text
source: Description
zh_hans: 描述

# SaveButton.Label
source: Save
zh_hans: 保存

# ReferencedFilePathTextBlock.Text
source: Referenced File
zh_hans: 引用的文件

# SelectFileButton.Content
source: Select File
zh_hans: 选择文件

# RemoveReferenceButton.Content
source: Remove Reference
zh_hans: 移除引用

# SearchTextBox.PlaceholderText
source: Search
zh_hans: 搜索

# TagNameTextBlock.Text
source: Tag Name
zh_hans: 标签名称

# SurnamesTextBlock.Text
source: Surnames
zh_hans: 别名

# LogicChainsTextBlock.Text
source: Logic Chains
zh_hans: 逻辑链

# PropertiesTextBlock.Text
source: Properties
zh_hans: 属性

# RemoveAppBarButton.Label
source: Remove
zh_hans: 移除

# CreatedTimeTextBlock.Text
source: Created Time
zh_hans: 创建时间

# ModifiedTimeTextBlock.Text
source: Modified Time
zh_hans: 修改时间

# NewButton.Label
source: New
zh_hans: 新建

# OpenButton.Content
source: Open
zh_hans: 打开

# EditAppBarButton.Label
source: Edit
zh_hans: 编辑

# MoveAppBarButton.Label
source: Move
zh_hans: 移动

# SortAppBarButton.Label
source: Sort
zh_hans: 排序

# SelectAppBarButton.Label
source: Select
zh_hans: 选择

# DeleteAppBarButton.Label
source: Delete
zh_hans: 删除

# ConfirmDeletingDataItemsDialogTitle.String
source: Are you sure you want to remove this/these items?
zh_hans: 你确定要移除这个/这些项目吗？

# Delete.String
source: Delete
zh_hans: 删除

# Cancel.String
source: Cancel
zh_hans: 取消

# ConfirmDeleteDataItemRemoveChildItemsCheckBox.Content
source: Also remove sub-items
zh_hans: 同时删除子项目

# ConfirmDeleteDataItemWarnNoRecycleBinTextBlock.Text
source: There's no any mechanism like recycle bins, your items would be removed permanently!
zh_hans: 该软件没有回收站机制，它们将会被永远删除！

# DataItemIsEmptyTextBlock.Text
source: Empty
zh_hans: 无项目

# DBContentExplorerPageNavigationViewItem.Content
source: Explore
zh_hans: 浏览

# RemoveReferenceAppBarButton.Label
source: Remove Reference
zh_hans: 移除引用

# ConfirmDeleteDataItemWarnWildSubitemsTextBlock.Text
source: If this item has sub-items, they would lost attachment in file explorer system. You can attach them later in wild data items manage page later.
zh_hans: 如果该项目有子项，它们将会丢失在文件浏览器和当前文件夹的连接。你可以稍后在未连接项页面管理它们。

# DetailTextBlock.Text
source: Detail
zh_hans: 详细信息

# AddReferenceAppBarButton.Label
source: Add Reference
zh_hans: 添加引用

# GlobalSearchModeMenuFlyoutItem.Text
source: Global search mode
zh_hans: 全局搜索模式

# FolderSearchModeMenuFlyoutItem.Text
source: Folder search mode
zh_hans: 文件夹搜索模式

# CurrentLayerSearchModeMenuFlyoutItem.Text
source: Current layer search mode
zh_hans: 层内搜索模式

# OrderByIDMenuFlyoutItem.Text
source: Order by ID
zh_hans: 按ID排列

# OrderByNameMenuFlyoutItem.Text
source: Order by name
zh_hans: 按名称排列

# OrderByCreatedTimeMenuFlyoutItem.Text
source: Order by created time
zh_hans: 按创建时间排列

# OrderByModifiedTimeMenuFlyoutItem.Text
source: Order by modified time
zh_hans: 按修改时间排列

# Ascending.String
source: Ascending
zh_hans: 升序

# ExitNavigationViewItem.Content
source: Exit
zh_hans: 退出

# LanguageTextBlock.Text
source: Language
zh_hans: 语言

# TutorialTextBlock.Text
source: Tutorial
zh_hans: 教程

# EnterTutorialButton.Content
source: Enter Totorial
zh_hans: 进入教程

# Skip.String
source: Skip
zh_hans: 跳过

# Close.String
source: Close
zh_hans: 关闭

# TutorialDatabaseOptionsTextBlock.Text
source: You can create, add database, and remove reference of database in the main page.
zh_hans: 在主页，你可以添加、创建数据库，并且可以删除数据库引用。

# TutorialDatabaseClickToOpenTextBlock.Text
source: Click to open database.
zh_hans: 点击以打开数据库。

# TutorialDataItemExplorerOptionsTextBlock.Text
source: You can change search mode, add, sort and select items in this page. Items added will be saved in current directory.
zh_hans: 在此页面，你可以切换搜索模式，添加、排序和选择数据项。添加的项目会保存到当前路径。

# TutorialDatabaseOptionsTitleTextBlock.Text
source: Manage Databases
zh_hans: 管理数据库

# TutorialDatabaseClickToOpenTitleTextBlock.Text
source: Open Database
zh_hans: 打开数据库

# TutorialDataItemExplorerOptionsTitleTextBlock.Text
source: Data Item Explorer
zh_hans: 数据浏览页

# TutorialSearchModeTitleTextBlock.Text
source: Search Mode
zh_hans: 搜索模式

# TutorialSearchModeTextBlock.Text
source: The search mode can be changed using this button. There's 3 search modes: global, folder and layer. The gobal search mode can search all data items in the database, including the items haven't connected to the root folder. The folder search mode can search items in current path and subitems of items in the path. The layer search mode can only search in current path.
zh_hans: 使用此按钮可以切换搜索模式。搜索模式有三种，全局，文件夹和当前层模式。 全局搜索模式可以在所有数据项中搜索，包括没有连接到根文件夹的数据项。 文件夹搜索模式可以在当前路径和当前路径数据项的子项中搜索。 当前层搜索模式只能在当前的路径中搜索。

# TutorialSearchConditionsTitleTextBlock.Text
source: Search Conditions
zh_hans: 搜素条件

# TutorialSearchConditionsTextBlock.Text
source: Conditional search uses tokens to search data items. If you want to search a tag, input in the search box and it will show you matched tags. Select a tag to add a tag condition. If you want to search text content, input text and then press Enter key to submit the text as a text condition. Only results match all the results will be shown.
zh_hans: 条件搜索利用token搜索数据项。如果你希望搜索标签，在搜索框输入，它会显示匹配的标签。选择标签以添加标签条件。如果你希望搜索文本内容，在搜索框输入文字后按Enter键来将它作为文本条件提交。只有满足所有条件的项目会显示在搜索结果中。

# TutorialTagPoolTitleTextBlock.Text
source: Tag Pool
zh_hans: 标签池

# TutorialTagPoolTextBlock.Text
source: Tag Pool is where you can manage and search tags. Press add button to add a new tag. Click a tag to view detail, modify and remove it. Caution: Remove a tag will remove all its reference. Think twice before you remove a tag. It's irreversible.
zh_hans: 在标签池你可以管理和搜索标签。点击”新建“按钮可以添加新的标签。点击标签可以查看详细信息，并可以修改和删除它。 注意：移除标签会同时移除它的所有引用。删除标签之前请三思，此操作不可恢复。

# TutorialTagProportiesTitleTextBlock.Text
source: Tag Proporties
zh_hans: 标签属性

# TutorialTagProportiesTextBlock.Text
source: Tag proporties describes an abstract property of a tag. We can use a specific tag to fill it when editing a data item.
zh_hans: 标签属性描述了一个标签的抽象属性。在编辑数据项时我们可以用具体的标签填充

# TutorialTagLogicChainsTitleTextBlock.Text
source: Logic Chains
zh_hans: 逻辑链

# TutorialTagLogicChainsTextBlock.Text
source: Logic chains describe the logical relation of a tag and other tags. Tips: If different things has same name, we recommend separate them into different tagss rather than use one tag to represent them. Such as kiwi(fruit) and kiwi(bird).
zh_hans: 逻辑链描述了标签和其它标签之间的逻辑关系。 提示：如果不同的事物有相同的名称，请把它们分成不同的标签，而不是共用一个标签。例如杜鹃（花）和杜鹃（鸟）。

# TagsTextBlock.Text
source: Tags
zh_hans: 标签

# TutorialEditDataItemTagsTitleTextBlock.Text
source: Data Item Tags
zh_hans: 数据项标签

# TutorialEditDataItemTagsTextBlock.Text
source: You can edit tags of a data item using tags and use specific tags to fill their proporty spaces(It's not necessary).
zh_hans: 你可以编辑数据项的标签，并且用其它标签填充它们的空位（这不是必要的）。

# IsContainRelationToggleSwitch.OnContent
source: Is a superset-subset relation
zh_hans: 是包含关系

# IsContainRelationToggleSwitch.OffContent
source: is not a superset-subset relation
zh_hans: 不是包含关系

# TagNotExists.String
source: Tag Not Exists
zh_hans: 标签不存在

# DoYouWantToCreateThisTagNow.String
source: Do you want to create this tag now?
zh_hans: 你想现在创建这个标签吗？

# Create.String
source: Create
zh_hans: 创建

# AreYouSureYouWantToRemoveThisTag.String
source: Are You Sure You Want To Remove This Tag?
zh_hans: 你确定要删除这个标签吗？

# AllReferencesWillBeRemovedAlong.String
source: All references will be removed alone.
zh_hans: 所有引用会被一并删除。

# Remove.String
source: Remove
zh_hans: 移除
